In [6]:
import numpy as np
np.set_printoptions(threshold=50)
path_data = '../../../assets/data/'
from datascience import *
topmovies = Table.read_table(path_data + 'top_movies_2017.csv')

<h2>Getting Started</h2>

In each section of this chapter, we will work with the Top Movies dataset we introduced earlier.  We will pose a question, break the question down into high-level steps, and then translate each step into Python code using `datascience` Tables. And build our solution by demonstrating some useful `datascience` methods.

In [7]:
topmovies

Title                            | Studio          | Gross     | Gross (Adjusted) | Year
Gone with the Wind               | MGM             | 198676459 | 1796176700       | 1939
Star Wars                        | Fox             | 460998007 | 1583483200       | 1977
The Sound of Music               | Fox             | 158671368 | 1266072700       | 1965
E.T.: The Extra-Terrestrial      | Universal       | 435110554 | 1261085000       | 1982
Titanic                          | Paramount       | 658672302 | 1204368000       | 1997
The Ten Commandments             | Paramount       | 65500000  | 1164590000       | 1956
Jaws                             | Universal       | 260000000 | 1138620700       | 1975
Doctor Zhivago                   | MGM             | 111721910 | 1103564200       | 1965
The Exorcist                     | Warner Brothers | 232906145 | 983226600        | 1973
Snow White and the Seven Dwarves | Disney          | 184925486 | 969010000        | 1937
... (190 rows omitted)

<h2>Selecting and Sorting</h2>

Let's use `datascience` to answer the following question:

**"What were the five highest-gross movies in 2016?"**

<h3>Breaking the Problem Down</h3>

We can decompose this question into the following simpler table manipulations:

1. Chose set of relevant columns (i.e. 'Title', 'Year' and 'Gross').
2. Select the rows for the year 2016.
3. Sort the rows in descending order by Gross.
4. Select the first five rows from the sorted Table.
   
Now, we can express these steps in Python programming.

<h2>Selecting</h2>

All the tasks (except task 3) in our broken-down problems involve selecting a subset of data from the Table. Therefore, we will start discussing the selection first to approach the first two tasks.

<h3>Accessing the Data in a Column</h3>

We can use a column's label to access the array of data in the column.

In [9]:
topmovies.column('Title')

array(['Gone with the Wind', 'Star Wars', 'The Sound of Music', ...,
       'The Firm', 'Suicide Squad', 'Who Framed Roger Rabbit'],
      dtype='<U60')

The 5 columns are indexed 0, 1, 2, 3, and 4. The column `Title` can also be accessed by using its column index.

In [10]:
topmovies.column(0)

array(['Gone with the Wind', 'Star Wars', 'The Sound of Music', ...,
       'The Firm', 'Suicide Squad', 'Who Framed Roger Rabbit'],
      dtype='<U60')

The items in the array are indexed 0, 1, 2, and so on, up to 199. The items in the column can be accessed using `item`, as with any array.

In [12]:
topmovies.column(4).item(5)

1956

<h4>Working with the Data in a Column</h4>

Because columns are arrays, we can use array operations on them to discover new information. For example, we can calculate 'Gross in Millions' from the gross.

In [14]:
topmovies = topmovies.with_columns(
    'Gross in Millions', topmovies.column('Gross')/1000000
)
topmovies

Title                            | Studio          | Gross     | Gross (Adjusted) | Year | Gross in Millions
Gone with the Wind               | MGM             | 198676459 | 1796176700       | 1939 | 198.676
Star Wars                        | Fox             | 460998007 | 1583483200       | 1977 | 460.998
The Sound of Music               | Fox             | 158671368 | 1266072700       | 1965 | 158.671
E.T.: The Extra-Terrestrial      | Universal       | 435110554 | 1261085000       | 1982 | 435.111
Titanic                          | Paramount       | 658672302 | 1204368000       | 1997 | 658.672
The Ten Commandments             | Paramount       | 65500000  | 1164590000       | 1956 | 65.5
Jaws                             | Universal       | 260000000 | 1138620700       | 1975 | 260
Doctor Zhivago                   | MGM             | 111721910 | 1103564200       | 1965 | 111.722
The Exorcist                     | Warner Brothers | 232906145 | 983226600        | 1973 | 232.906
Snow White and the Seven Dwarves | Disney          | 184925486 | 969010000        | 1937 | 184.925
... (190 rows omitted)

To make the proportions in the new columns appear as currency, we can use the method `set_format` with the option `CurrencyFormatter`. The `set_format` method takes `Formatter` objects, which exist for dates (`DateFormatter`), percent (`PercentFormatter`), numbers, and curriecies.

In [15]:
topmovies.set_format('Gross in Millions', CurrencyFormatter("$"))

Title                            | Studio          | Gross     | Gross (Adjusted) | Year | Gross in Millions
Gone with the Wind               | MGM             | 198676459 | 1796176700       | 1939 | BZ$198.68
Star Wars                        | Fox             | 460998007 | 1583483200       | 1977 | BZ$461.00
The Sound of Music               | Fox             | 158671368 | 1266072700       | 1965 | BZ$158.67
E.T.: The Extra-Terrestrial      | Universal       | 435110554 | 1261085000       | 1982 | BZ$435.11
Titanic                          | Paramount       | 658672302 | 1204368000       | 1997 | BZ$658.67
The Ten Commandments             | Paramount       | 65500000  | 1164590000       | 1956 | BZ$65.50
Jaws                             | Universal       | 260000000 | 1138620700       | 1975 | BZ$260.00
Doctor Zhivago                   | MGM             | 111721910 | 1103564200       | 1965 | BZ$111.72
The Exorcist                     | Warner Brothers | 232906145 | 983226600        | 1973 | BZ$232.91
Snow White and the Seven Dwarves | Disney          | 184925486 | 969010000        | 1937 | BZ$184.93
... (190 rows omitted)

<h3>Selecting Columns</h3>

The method `select` creates a new table that contains only the specified columns.

The result of using `select` is a new table, even when you select just one column.

In [34]:
topmovies.select('Title')

Title
Gone with the Wind
Star Wars
The Sound of Music
E.T.: The Extra-Terrestrial
Titanic
The Ten Commandments
Jaws
Doctor Zhivago
The Exorcist
Snow White and the Seven Dwarves
... (190 rows omitted)

In [19]:
topmovies.column('Title')

array(['Gone with the Wind', 'Star Wars', 'The Sound of Music', ...,
       'The Firm', 'Suicide Squad', 'Who Framed Roger Rabbit'],
      dtype='<U60')

Notice that the result is a table, unlike the result of `column`, which is an array.

We can select multiple columns as well.

In [32]:
topmovies.select('Title', 'Year','Gross')

Title                            | Year | Gross
Gone with the Wind               | 1939 | 198676459
Star Wars                        | 1977 | 460998007
The Sound of Music               | 1965 | 158671368
E.T.: The Extra-Terrestrial      | 1982 | 435110554
Titanic                          | 1997 | 658672302
The Ten Commandments             | 1956 | 65500000
Jaws                             | 1975 | 260000000
Doctor Zhivago                   | 1965 | 111721910
The Exorcist                     | 1973 | 232906145
Snow White and the Seven Dwarves | 1937 | 184925486
... (190 rows omitted)

The same selection can be made using column indices instead of labels.

In [33]:
topmovies.select(0, 2, 4)

Title                            | Gross     | Year
Gone with the Wind               | 198676459 | 1939
Star Wars                        | 460998007 | 1977
The Sound of Music               | 158671368 | 1965
E.T.: The Extra-Terrestrial      | 435110554 | 1982
Titanic                          | 658672302 | 1997
The Ten Commandments             | 65500000  | 1956
Jaws                             | 260000000 | 1975
Doctor Zhivago                   | 111721910 | 1965
The Exorcist                     | 232906145 | 1973
Snow White and the Seven Dwarves | 184925486 | 1937
... (190 rows omitted)

Another way to create a new table consisting of a set of columns is to `drop` the columns you don't want.

In [36]:
topmovies.drop( 'Gross (Adjusted)','Gross in Millions', 'Studio')

Title                            | Gross     | Year
Gone with the Wind               | 198676459 | 1939
Star Wars                        | 460998007 | 1977
The Sound of Music               | 158671368 | 1965
E.T.: The Extra-Terrestrial      | 435110554 | 1982
Titanic                          | 658672302 | 1997
The Ten Commandments             | 65500000  | 1956
Jaws                             | 260000000 | 1975
Doctor Zhivago                   | 111721910 | 1965
The Exorcist                     | 232906145 | 1973
Snow White and the Seven Dwarves | 184925486 | 1937
... (190 rows omitted)

Neither `select` nor `drop` change the original table. Instead, they create new smaller tables that share the same data. The fact that the original table is preserved is useful! You can generate multiple different tables that only consider certain columns without worrying that one analysis will affect the other.

In [22]:
topmovies

Title                            | Studio          | Gross     | Gross (Adjusted) | Year | Gross in Millions
Gone with the Wind               | MGM             | 198676459 | 1796176700       | 1939 | BZ$198.68
Star Wars                        | Fox             | 460998007 | 1583483200       | 1977 | BZ$461.00
The Sound of Music               | Fox             | 158671368 | 1266072700       | 1965 | BZ$158.67
E.T.: The Extra-Terrestrial      | Universal       | 435110554 | 1261085000       | 1982 | BZ$435.11
Titanic                          | Paramount       | 658672302 | 1204368000       | 1997 | BZ$658.67
The Ten Commandments             | Paramount       | 65500000  | 1164590000       | 1956 | BZ$65.50
Jaws                             | Universal       | 260000000 | 1138620700       | 1975 | BZ$260.00
Doctor Zhivago                   | MGM             | 111721910 | 1103564200       | 1965 | BZ$111.72
The Exorcist                     | Warner Brothers | 232906145 | 983226600        | 1973 | BZ$232.91
Snow White and the Seven Dwarves | Disney          | 184925486 | 969010000        | 1937 | BZ$184.93
... (190 rows omitted)

As we are interested in only 'Title', 'Year', and 'Gross', let's keep those three only for the future uses in this section.

In [43]:
topmovies = topmovies.select('Title', 'Year','Gross')
topmovies

Title                            | Year | Gross
Gone with the Wind               | 1939 | 198676459
Star Wars                        | 1977 | 460998007
The Sound of Music               | 1965 | 158671368
E.T.: The Extra-Terrestrial      | 1982 | 435110554
Titanic                          | 1997 | 658672302
The Ten Commandments             | 1956 | 65500000
Jaws                             | 1975 | 260000000
Doctor Zhivago                   | 1965 | 111721910
The Exorcist                     | 1973 | 232906145
Snow White and the Seven Dwarves | 1937 | 184925486
... (190 rows omitted)

<h3>Selecting Rows</h3>

Often, we would like to extract just those rows that correspond to entries with a particular feature. For example, movies released in the year 2016. Or you might want to take the first five movies.

<h4>Specified Rows</h4>
The Table method `take` does just that – it takes a specified set of rows. Its argument is a row index or array of indices, and it creates a new table consisting of only those rows.

In [41]:
# Let's start by taking the first rows only
topmovies.take(0)

Title              | Year | Gross
Gone with the Wind | 1939 | 198676459

Similarly you can take the first 5 rows.

In [44]:
topmovies.take(np.arange(5))

Title                       | Year | Gross
Gone with the Wind          | 1939 | 198676459
Star Wars                   | 1977 | 460998007
The Sound of Music          | 1965 | 158671368
E.T.: The Extra-Terrestrial | 1982 | 435110554
Titanic                     | 1997 | 658672302

Or you may want to take the fourth, fifth, and sixth rows by specifying a range of indices as the argument.

In [46]:
topmovies.take(np.arange(3,6))

Title                       | Year | Gross
E.T.: The Extra-Terrestrial | 1982 | 435110554
Titanic                     | 1997 | 658672302
The Ten Commandments        | 1956 | 65500000

<h4> Rows Corresponding to a Special Feature</h4>

More often, we will want to access data in a set of rows that have a certain feature, but whose indices we don’t know ahead of time. For example, we want to get the movies that were released in the year 2016. but we don’t want to spend time counting rows in the table.

The method `where` is used for this purpose. Its output is a table with the same columns as the original but only the rows where the feature occurs. It has two arguments:

The first argument of `where` is the label of the column that contains the information about whether or not a row has the feature we want. If the feature is "Produces is Fox studios" then the column in Studio.

The second argument of `where` is a way of specifying the feature. (We often call it predicate)

**We will use this type of row selection to solve our problem stated at the beginning of this section.**

In our question, we are interested in only the movies that were released in the year 2016. To get the movies released in 2016 we can use `where` method and apply `equal_to` predicate on the 'Year' column. We

In [53]:
topmovies2016 = topmovies.where('Year', are.equal_to(2016))
topmovies2016

Title                              | Year | Gross
Rogue One: A Star Wars Story       | 2016 | 532177324
Finding Dory                       | 2016 | 486295561
Captain America: Civil War         | 2016 | 408084349
The Secret Life of Pets            | 2016 | 368384330
Deadpool                           | 2016 | 363070709
The Jungle Book (2016)             | 2016 | 364001123
Zootopia                           | 2016 | 341268248
Batman v Superman: Dawn of Justice | 2016 | 330360194
Suicide Squad                      | 2016 | 325100054

We may apply a pipeline of where conditions on different columns with different predicates. For example, for movies released in 2016 which made more than 400 million we need to access rows that have multiple features.

In [55]:
topmovies.where('Year', are.equal_to(2016)).where('Gross', are.above(400000000))

Title                        | Year | Gross
Rogue One: A Star Wars Story | 2016 | 532177324
Finding Dory                 | 2016 | 486295561
Captain America: Civil War   | 2016 | 408084349

The general way to create a new table by selecting rows with a given feature is to use `where` and `are` with the appropriate condition:

`original_table_name.where(column_label_string, are.condition)`. Remember that it does not change the original table; we need to assign this to some other table if we want to use this later.

**Note**: Check out the predicates often used as a condition [here](https://www.data8.org/datascience/predicates.html#datascience.predicates.are).

<h2>Sorting</h2>

Often we want to rank data based on the values of a Column. That's when sorting a Table becomes useful. Sorting is particularly useful when dealing with large datasets, where manually finding and comparing data points would be impractical.

As we already have the movies in the year 2016 in the `topmovies2016` table, now it comes to the point of finding the movies with the highest gross. We use soring for that purpose. To sort a table based on a column value we use the `Table.sort` method. It takes the column name as an argument and returns a new table where rows are sorted based on the column value. 

In our case we want our Table to be sorted based on the column 'Gross'.

In [56]:
topmovies2016.sort('Gross')

Title                              | Year | Gross
Suicide Squad                      | 2016 | 325100054
Batman v Superman: Dawn of Justice | 2016 | 330360194
Zootopia                           | 2016 | 341268248
Deadpool                           | 2016 | 363070709
The Jungle Book (2016)             | 2016 | 364001123
The Secret Life of Pets            | 2016 | 368384330
Captain America: Civil War         | 2016 | 408084349
Finding Dory                       | 2016 | 486295561
Rogue One: A Star Wars Story       | 2016 | 532177324

Note that when we sort the Table on 'Gross' without specifying anything, we got the movies with lowest gross to highest gross (ascending order). We want it to be the other way around. By default `Table.sort` method sorts the Table in ascending order. To change the order we need to specify descending =True as an optional argument.

In [57]:
sorted2016 = topmovies2016.sort('Gross', descending =True)
sorted2016

Title                              | Year | Gross
Rogue One: A Star Wars Story       | 2016 | 532177324
Finding Dory                       | 2016 | 486295561
Captain America: Civil War         | 2016 | 408084349
The Secret Life of Pets            | 2016 | 368384330
The Jungle Book (2016)             | 2016 | 364001123
Deadpool                           | 2016 | 363070709
Zootopia                           | 2016 | 341268248
Batman v Superman: Dawn of Justice | 2016 | 330360194
Suicide Squad                      | 2016 | 325100054

Now we have the sorted data on the 'Gross' column in sorted2016 table. The last step is to take the top 5 movies which can be easily done by taking the first 5 rows in the Table.

In [59]:
sorted2016.take(np.arange(5))

Title                        | Year | Gross
Rogue One: A Star Wars Story | 2016 | 532177324
Finding Dory                 | 2016 | 486295561
Captain America: Civil War   | 2016 | 408084349
The Secret Life of Pets      | 2016 | 368384330
The Jungle Book (2016)       | 2016 | 364001123

In [ ]:
And here we get our answer to the initial question.

**All of the methods that we have used above can be applied to any table.**

<h2>Conclusion</h2>
In this section we answered a data science question from tabular data using selecting and sorting methods from `datascience. First we broke down our question into doable smaller subproblems and then we solved each smaller subproblems using Python programming to get the answer to our main question.